АлогистикТест2/src/Catalogs/алк_ПлановыеПоказатели/алк_ПлановыеПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ПлановыеПоказатели</name>
  <attributes>
    <name>ИмяДляЗапросов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаспределятьПланПоДням</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияПроизводства</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспределятьПланПоСменам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСменДляРаспределения</name>
    <type>
      <types>EnumRef.алк_ТипСмен</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/алк_ПлановыеПоказатели/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	ИмяДляЗапросов = "";
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(ИмяДляЗапросов) тогда
		ИмяДляЗапросов = СтрЗаменить(Наименование, " -", "");
	КонецЕсли;
	
	Если РаспределятьПланПоСменам И НЕ ЗначениеЗаполнено(ТипСменДляРаспределения) Тогда
		Сообщить("Не заполнен тип смен для распределения");	
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
